# Brewfile for Mac System Setup
# Generated from Ansible playbook analysis

# Taps
tap "mongodb/brew"
tap "koekeishiya/formulae"
tap "FelixKratz/formulae"

# Formulas (Regular Packages)
brew "ranger"
brew "fzf"
brew "chafa"
brew "ninja"
brew "make"
brew "pandoc"
brew "stow"
brew "trash"
brew "ripgrep"
brew "jq"
brew "meson"
brew "mongosh"
brew "pyenv"
brew "cmake"
brew "htop"
brew "sevenzip"
brew "zsh-completions"
brew "openjdk@11"
brew "openapi-generator"
brew "redis"
brew "kotlin"
brew "gh"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "go"
brew "node"
brew "wireshark"
brew "xclip"
brew "zsh"
brew "tmux"
brew "fontconfig"

# Formulas from custom taps
brew "koekeishiya/formulae/skhd"
brew "FelixKratz/formulae/sketchybar"
brew "koekeishiya/formulae/yabai"
brew "mongodb/brew/mongodb-database-tools"

# Casks (GUI Applications)
cask "1password"
cask "beekeeper-studio"
cask "slack"
cask "google-chrome"
cask "postman"
cask "mongodb-compass"
cask "visual-studio-code"
cask "android-sdk"
cask "android-studio"
cask "homebrew/cask-versions/temurin8"
cask "cyberduck"

# Font casks - Nerd Fonts
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-sketchybar-app-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-noto-color-emoji"

# Additional casks
cask "libreoffice"
cask "flameshot"
cask "docker"
cask "zoom"

